# CannotCutInstanceOut Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutFailures..::..CannotCutInstanceOut Property
BuiltInFailures..::..CutFailures Class See Also
---
Can't cut instance of [Symbol] out of Wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCutInstanceOut { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCutInstanceOut As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCutInstanceOut {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CutFailures Class
Autodesk.Revit.DB Namespace